tutorials/quadraticGridStudy/quadraticGrid900/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;

    div(phi,U)                      Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div(diffusivity,U)              Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear orthogonal;
    
    laplacian(IBM,U)    IBMGauss linear orthogonal; //IBM
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default             orthogonal;
}


// ************************************************************************* //
